//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Welcome to Melanoma_predict test-log.

Model: "sequential_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 222, 222, 32)      896       
_________________________________________________________________
dropout_12 (Dropout)         (None, 222, 222, 32)      0         
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 111, 111, 32)      0         
_________________________________________________________________
flatten_12 (Flatten)         (None, 394272)            0         
_________________________________________________________________
dense_36 (Dense)             (None, 140)               55198220  
_________________________________________________________________
dense_37 (Dense)             (None, 64)                9024      
_________________________________________________________________
dense_38 (Dense)             (None, 1)                 65        
=================================================================
Total params: 55,208,205
Trainable params: 55,208,205
Non-trainable params: 0
_________________________________________________________________


target_size=(224, 224)
Conv2D (activation='relu'), 
Dropout(0.35)
Dense 1 (140, activation='selu'), 
Dense 2 (64, activation='selu'), 
Dense 3 (1, activation='sigmoid')
Dense(64, activation='relu')
Optimizers SGD
Learning_rate = 0.002, momentum=0.8

Mean val_binary_accuracy all epochs -  0.8996,  std  - 0.046
Saved to: melanoma_v1_40_0.932.h5 421.2 Mb.

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////